sources/MeasurementUnits/Catalogs/МСЕдиницыВеличинПриставкиКратныхИДольных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МСЕдиницыВеличинПриставкиКратныхИДольных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Степень по указанному основанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приставка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриставкаМеждународная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбозначениеМеждународное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриставкаISO_80000_1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбозначениеISO_80000_1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриставкаМеждународнаяISO_80000_1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбозначениеМеждународноеISO_80000_1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/MeasurementUnits/Catalogs/МСЕдиницыВеличинПриставкиКратныхИДольных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	// Результат.Добавить("Код");
	Результат.Добавить("Основание");
	Результат.Добавить("Порядок");
	
	Возврат Результат;
	
КонецФункции

// Возвращает элемент справочника по основанию степени и показателю.
//
// Параметры:
//  ПоказательСтепени	- Строка, Число		- Показатель степени
//  ОснованиеСтепени    - Строка, Число		- Основание степени
// 
// Возвращаемое значение:
//   Ссылка             - элемент справочника
//   Неопределено       - в случае, искомый элемент не найден.
//
Функция НайтиПоПоказателю(Знач ПоказательСтепени, Знач ОснованиеСтепени = 10) Экспорт
	Возврат НайтиПоКоду(ПолучитьКод(ПоказательСтепени, ОснованиеСтепени));
КонецФункции

// Создаёт либо обновляет поставляемый элемент справочника при обновлении ИБ.
//
// Параметры:
//  Основание           - Число		- Основание степени
//  Показатель			- Число		- Показатель степени
//  Наименование 		- Строка    - Наименование приставки
//  Обозначение 		- Строка    - Обозначение приставки
// 
Процедура ЗаполнитьПредопределённый(Знач Основание, Знач Порядок, Знач Наименование,
	Знач Приставка, Знач Обозначение,
	Знач ПриставкаМеждународная, Знач ОбозначениеМеждународное,
	Знач ПриставкаISO_80000_1 = Неопределено, Знач ОбозначениеISO_80000_1 = Неопределено,
	Знач ПриставкаМеждународнаяISO_80000_1 = Неопределено, Знач ОбозначениеМеждународноеISO_80000_1 = Неопределено) Экспорт
	
	Перем ТребуетсяЗапись;
		
	Параметры = Новый ФиксированнаяСтруктура(
		"Основание,Порядок,Наименование," +
		"Приставка,Обозначение," +
		"ПриставкаМеждународная,ОбозначениеМеждународное," +
		"ПриставкаISO_80000_1,ОбозначениеISO_80000_1," +
		"ПриставкаМеждународнаяISO_80000_1,ОбозначениеМеждународноеISO_80000_1",
		Основание, Порядок, Наименование,
		Приставка, Обозначение,
		ПриставкаМеждународная, ОбозначениеМеждународное,
		?(ПриставкаISO_80000_1 <> Неопределено, ПриставкаISO_80000_1, Приставка),
			?(ОбозначениеISO_80000_1 <> Неопределено, ОбозначениеISO_80000_1, Обозначение),
		?(ПриставкаМеждународнаяISO_80000_1 <> Неопределено, ПриставкаМеждународнаяISO_80000_1, ПриставкаМеждународная),
			?(ОбозначениеМеждународноеISO_80000_1 <> Неопределено, ОбозначениеМеждународноеISO_80000_1, ОбозначениеМеждународное)
	);

	Приставка = НайтиПоПоказателю(Порядок, Основание);
	
	Если Приставка <> ПустаяСсылка() Тогда
		
		ТребуетсяЗапись = Ложь;
		
		Для Каждого Реквизит из Параметры цикл
			ТребуетсяЗапись = НЕ (Реквизит.Значение = Приставка[Реквизит.Ключ]);
			Если ТребуетсяЗапись Тогда
                Прервать;
	        КонецЕсли;
	    КонецЦикла;

		Если НЕ ТребуетсяЗапись Тогда
			Возврат;
		Иначе
			ПриставкаОбъект = Приставка.ПолучитьОбъект();
		КонецЕсли;
		
	Иначе
		
		ПриставкаОбъект = СоздатьЭлемент();
		
	КонецЕсли;
	
	ПриставкаОбъект.Заполнить(Параметры);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПриставкаОбъект, , Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Перем БлокируемыеРеквизиты;
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Код");
	
	Для Каждого Реквизит Из Метаданные.Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.Реквизиты Цикл
		БлокируемыеРеквизиты.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь; 
    Поля.Добавить("Наименование");
    Поля.Добавить("Основание");
    Поля.Добавить("Порядок");
КонецПроцедуры 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
	
	Если Данные.Порядок = 0 Тогда
		Представление = "";
	Иначе
	    Представление = Данные.Наименование + " (" + Данные.Основание + РаботаСоСтрокамиЮникодКлиентСервер.ПолучитьСтрокуИзПоказателяСтепени(Данные.Порядок) + ")";
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Преобразует переданные основание и показатель степени (число) в значение кода для справочника.
//
// Параметры:
//  ПоказательСтепени	 - Строка, Число	 - Показатель степени
//  ОснованиеСтепени     - Строка, Число     - Основание степени
// 
// Возвращаемое значение:
//   Число - значение кода для справочника
//
Функция ПолучитьКод(Знач ПоказательСтепени, Знач ОснованиеСтепени = 10) Экспорт
	ПоказательСтепениЧисло = Число(ПоказательСтепени);
	ОснованиеСтепениЧисло = Число(ОснованиеСтепени);
	Результат = (ПоказательСтепениЧисло + 100)*100 + ОснованиеСтепениЧисло;
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
